Working_examples/POD_RBF_cylinder/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh      dynamicMotionSolverFvMesh;

motionSolverLibs ("libsixDoFRigidBodyMotion.so");

solver            sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
    patches         (cylinder);
    innerDistance   0.16;
    outerDistance   0.4;

    mass            0.0683441225737777;
    centreOfMass    (0 0 0);
    momentOfInertia (1 1 1);
    orientation
    (
       1 0 0
       0 1 0
       0 0 1
    );
    angularMomentum (0 0 0);
    g               (0 0 0);
    rhoName         rhoInf;
    rhoInf          999.1026;
    report          on;



    solver
    {
        type symplectic;
    }




    constraints
    {
        yLine
        {
            sixDoFRigidBodyMotionConstraint line;
            centreOfRotation    (0 0 0);
            direction           (0 1 0);
        }
	/*	xLine
       {
            sixDoFRigidBodyMotionConstraint line;
            centreOfRotation    (0 0 0);
            direction           (1 0 0);
        }
	*/
	zAxis
	 {
	  sixDoFRigidBodyMotionConstraint axis;
            axis                (0 0 1);
	 }
	DontRotate
         {
                //Warning: Only valid where the predicted deviation from alignment is 		 //< 90 degrees.

          sixDoFRigidBodyMotionConstraint orientation;
          tolerance       1e-06;
          relaxationFactor 0.7;
          fixedOrientationCoeffs
                {
                  //This is necessary, even if kept empty
                }
	  }

    }

    restraints
    {
        verticalSpring
        {
            sixDoFRigidBodyMotionRestraint linearSpring;

            anchor          (0 0 0);
            refAttachmentPt (0 0 0);
            stiffness       1.660953662271618;
            damping        0.004344354818166;
            restLength      0;
        }
			
	//axialSpring
        //{
            //sixDoFRigidBodyMotionRestraint linearAxialAngularSpring;

            //axis            (0 0 1);
            //stiffness       700;
            //damping         0.50;
            //referenceOrientation $orientation;
        //}


    }
}


// ************************************************************************* //
