Working_examples/POD_RBF_cylinder/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesU 7;
NmodesP 7;
NmodesSUP 7;
NmodesNUT 1;
NmodesProject 50;
NmodesMatrixRec 7;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;
